## Production: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 4 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_appautoscaling_scheduled_action.api-5pm will be created
  + resource "aws_appautoscaling_scheduled_action" "api-5pm" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "api-5pm"
      + resource_id        = "function:api-lambda:4"
      + scalable_dimension = "lambda:function:ProvisionedConcurrency"
      + schedule           = "cron(0 17 * * ? *)"
      + service_namespace  = "lambda"
      + timezone           = "America/Toronto"

      + scalable_target_action {
          + max_capacity = "5"
          + min_capacity = "1"
        }
    }

  # aws_appautoscaling_scheduled_action.api-noon will be created
  + resource "aws_appautoscaling_scheduled_action" "api-noon" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "api-noon"
      + resource_id        = "function:api-lambda:4"
      + scalable_dimension = "lambda:function:ProvisionedConcurrency"
      + schedule           = "cron(0 12 * * ? *)"
      + service_namespace  = "lambda"
      + timezone           = "America/Toronto"

      + scalable_target_action {
          + max_capacity = "10"
          + min_capacity = "3"
        }
    }

  # aws_appautoscaling_target.api will be created
  + resource "aws_appautoscaling_target" "api" {
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 3
      + resource_id        = "function:api-lambda:4"
      + role_arn           = (known after apply)
      + scalable_dimension = "lambda:function:ProvisionedConcurrency"
      + service_namespace  = "lambda"
    }

  # aws_lambda_provisioned_concurrency_config.api will be created
  + resource "aws_lambda_provisioned_concurrency_config" "api" {
      + function_name                     = "api-lambda"
      + id                                = (known after apply)
      + provisioned_concurrent_executions = 1
      + qualifier                         = "4"
    }

  # aws_secretsmanager_secret_version.ecr-user-access-key will be updated in-place
  ~ resource "aws_secretsmanager_secret_version" "ecr-user-access-key" {
        id             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:ecr-user-access-key-CxV3Au|B7A6F250-D567-41C2-8C0C-90DC74F3A7F5"
      + secret_binary  = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ secret_string  = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # aws_wafv2_web_acl.api_lambda will be updated in-place
  ~ resource "aws_wafv2_web_acl" "api_lambda" {
        id         = "21faf60d-21e5-4308-b476-14a86832ed01"
        name       = "api-lambda-waf"
        tags       = {
            "CostCenter" = "notification-canada-ca-production"
        }
        # (5 unchanged attributes hidden)


      - rule {
          - name     = "AWSManagedRulesLinuxRuleSet" -> null
          - priority = 4 -> null

          - override_action {
              - count {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesLinuxRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesLinuxRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 4

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (7 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.ecr-user-access-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]

25 tests, 8 passed, 17 warnings, 0 failures, 0 exceptions

```

</details>
